cask_args appdir: '/Applications'

# =========================================================
# Tap some casks
# =========================================================
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'heroku/brew'
tap 'homebrew/bundle'
tap 'universal-ctags/universal-ctags'

# =========================================================
# Quicklook extensions
# =========================================================
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'webpquicklook'

# =========================================================
# Font me (includes Powerline patch in base font)
# =========================================================
cask 'font-source-code-pro'

# ===============================================
# Development
# ===============================================

# *Nix Tools
brew 'autoconf'
brew 'automake'
brew 'cmake'
brew 'coreutils'
brew 'makedepend'
brew 'pcre'
brew 'wget'

# Development tools
brew 'bcrypt'
brew 'docker'
brew 'fzf'
brew 'git'
brew 'heroku/brew/heroku'
brew 'htop'
brew 'httpie'
brew 'hub'
cask 'karabiner-elements'
brew 'neovim'
system 'pip3 install neovim'
brew 'p7zip'
brew 'reattach-to-user-namespace'
brew 'ripgrep'
brew 'tig'
brew 'tmux', args: ['HEAD']
brew 'tree'
brew 'universal-ctags/universal-ctags/universal-ctags', args: ['HEAD']
brew 'watchman'
brew 'zsh'

# Libraries
brew 'imagemagick', args: ['with-libtiff', 'with-little-cms', 'with-ghostscript']

# Languages
brew 'go'
brew 'dep'
brew 'rbenv'
brew 'nodenv'
brew 'yarn', args: ['without-node']

# Databases
brew 'mysql', restart_service: :changed
brew 'postgresql', restart_service: :changed
brew 'redis', restart_service: :changed

# Java things that require password
cask "caskroom/versions/java8"
brew 'elasticsearch', restart_service: :changed

# ===============================================
# Applications
# ===============================================
cask 'alfred'
cask 'dash'
cask 'firefox'
cask 'firefox-developer-edition'
cask 'flux'
cask 'google-chrome'
cask 'iterm2'
cask 'keepingyouawake'
cask 'licecap'
brew 'pianobar'
cask 'postman'
cask 'sequel-pro'
cask 'slack'
cask 'spotify'
cask 'vlc'

mas 'Magnet', id: 441258766
mas 'The Unarchiver', id: 425424353
mas 'Dashlane - Password Manager', id: 552383089
